#+title: A Study Of Concurrent Data Structures With Relaxed Semantics
#+author: Miguel Angel Piña Avelino
#+date: \today

*** Callables and Futures

    Like Runnable, executors can work with other kinds of tasks. We called these
    tasks callables (~Callable~ interface). Such interface is similar to ~Runnable~,
    but instead of returning void after calling its =run= method, it returns a
    value. These objects are parameters for the method =submit= of the
    executorService. This method does not wait until the task completes. The
    executor service cannot return the result of the callable objecty. In that
    case, the executor returns an object of type ~Future~. We can retrieve the
    computation result from the ~Callable~ object using the ~Future~ objects. The
    /futures/ have a method called =isDone()=, with this method we can check if the
    /future/ has already finished its execution. Another method available for
    /futures/ is =get()=. Calling this method blocks the current threads and waits
    until the /callable/ completes its execution. An example is below:


    #+begin_src java
      import java.util.concurrent.Callable;
      import java.util.concurrent.Executors;
      import java.util.concurrent.ExecutorService;
      import java.util.concurrent.ExecutionException;
      import java.util.concurrent.Future;
      import java.util.concurrent.TimeUnit;

      public class App {
          public static void main(String args[]) throws ExecutionException {
              Callable<Integer> task = () -> {
                  try {
                      TimeUnit.SECONDS.sleep(2);
                      return 42;
                  }
                  catch (InterruptedException e) {
                      System.out.println("Error " + e.getMessage());
                      e.printStackTrace();
                  }
                  return -1;
              };

              ExecutorService executor = Executors.newFixedThreadPool(1);
              try {
                  Future<Integer> future = executor.submit(task);
                  System.out.println(String.format("Future done? %b", future.isDone()));
                  Integer result = future.get();
                  System.out.println(String.format("Future done? %b", future.isDone()));
                  System.out.println(String.format("Result: %d", result));
                  executor.shutdown();
              }
              catch (InterruptedException | ExecutionException e) {
                  System.out.println("Error " + e.getMessage());
                  e.printStackTrace();
                  executor.shutdown();
              }

          }
      }
    #+end_src

    #+RESULTS:
    : Future done? false
    : Future done? true
    : Result: 42


    Calls to =future.get()= will block the current thread and wait until the
    computation finish. But, sometimes this call can runs forever and making the
    program unresponsive. To counterattack this type of scenarios, you can add a
    timeout to avoid endless executions. An example below:

    #+begin_src java :output results
      import java.util.concurrent.Callable;
      import java.util.concurrent.Executors;
      import java.util.concurrent.ExecutorService;
      import java.util.concurrent.ExecutionException;
      import java.util.concurrent.Future;
      import java.util.concurrent.TimeUnit;
      import java.util.concurrent.TimeoutException;


      public class App {
          public static void main(String args[]) throws ExecutionException {
              Callable<Integer> task = () -> {
                  try {
                      TimeUnit.SECONDS.sleep(4);
                      return 42;
                  }
                  catch (InterruptedException e) {
                      System.out.println("Error " + e.getMessage());
                      e.printStackTrace();
                  }
                  return -1;
              };

              ExecutorService executor = Executors.newFixedThreadPool(1);
              try {
                  Future<Integer> future = executor.submit(task);
                  System.out.println(String.format("Future done? %b", future.isDone()));
                  Integer result = future.get(1, TimeUnit.SECONDS);
                  System.out.println(String.format("Future done? %b", future.isDone()));
                  System.out.println(String.format("Result: %d", result));
                  executor.shutdown();
              }
              catch (InterruptedException | ExecutionException | TimeoutException e) {
                  System.out.println("Error " + e.getLocalizedMessage());
                  e.printStackTrace();
                  executor.shutdown();
              }
          }
      }
    #+end_src

    #+RESULTS:
    : Future done? false
    : Error null


    The last method we will cover of ExecutorService (there are a plenty more
    but we will not cover them) is =invokeAll=. =InvokeAll= allows batch submitting
    of multiple /callables/. This method accepts a collection of /callables/ and
    returns a list of /futures/.

    #+begin_src java :output results
      import java.util.concurrent.Callable;
      import java.util.concurrent.Executors;
      import java.util.concurrent.ExecutorService;
      import java.util.concurrent.ExecutionException;
      import java.util.concurrent.Future;
      import java.util.concurrent.TimeUnit;

      public class App {
          public static void main(String args[]) throws ExecutionException {
              try {
                  ExecutorService executor = Executors.newFixedThreadPool(1);

                  List<Callable<String>> callables = Arrays
                      .asList(
                              () -> {
                                  TimeUnit.SECONDS.sleep(2);
                                  return "task 1";
                              },
                              () -> {
                                  TimeUnit.SECONDS.sleep(2);
                                  return "task 2";
                              },
                              () -> {
                                  TimeUnit.SECONDS.sleep(2);
                                  return "task 3";
                              });

                  executor.invokeAll(callables)
                      .stream()
                      .map(future -> {
                              try {
                                  return future.get();
                              } catch (Exception e) {
                                  throw new IllegalStateException(e);
                              }
                          })
                      .forEach(System.out::println);
                  executor.shutdown();
              }
              catch (InterruptedException e) {
                  System.out.println("Error " + e.getMessage());
                  e.printStackTrace();
              }

          }
      }
    #+end_src

    #+RESULTS:
    : task 2
    : task 3
    : task 1

    We can get better results if we increment the number of available threads
    for the executorService. By example, using the previous instruction and
    setting it as the fixed value:

    #+begin_src java
      int numProcessors = Runtime.getRuntime().availableProcessors();
      ExecutorService executor = Executors.newFixedThreadPool(numProcessors);
    #+end_src

    It is not necessary call =parallelStream= from the *Stream* API because the
    =executorService= assign each task to an available thread in its pool. But,
    depending on the method called (=stream= or =parallelStream=), the order of the
    results may vary. This is due to stream (sequential) is pipelined in a
    single thread instead of use multiple threads.


*** Synchronized

    When we implement a more complex multithreaded program, there are sections
    of code that are accessed by multiple threads. We need to pay attention when
    accessing to shared mutable variable concurrently. By example, lets think in
    a counter used by multiple threads concurrently. A first approach could be
    the following:

    #+begin_src java
      import java.util.concurrent.ExecutorService;
      import java.util.concurrent.Executors;
      import java.util.stream.IntStream;

      public class App {

          public static void main(String[] args) {
              Counter c = new Counter();
              c.test();
          }

      }

      class Counter {
          int count = 0;

          void increment() {
              count = count + 1;
          }

          public void test() {
              int numProcessors = Runtime.getRuntime().availableProcessors();
              ExecutorService executor = Executors.newFixedThreadPool(numProcessors);
              IntStream.range(0, 10000)
                  .forEach(i -> executor.submit(this::increment));

              executor.shutdown();
              System.out.println(count);
          }
      }
    #+end_src

    #+RESULTS:
    : 3772

    We can see that the value obtained is inconsistent with the value
    expected. This happen due a race condition.  To avoid this problem, java
    provides a simple mechanism to provide thread synchronization, this through
    the keyword =synchronized=. Internally, Java uses a monitor lock to manage
    synchronization. Let see an example:

    #+begin_src java
      import java.util.concurrent.ExecutorService;
      import java.util.concurrent.Executors;
      import java.util.stream.IntStream;

      public class App {

          public static void main(String[] args) {
              Counter c = new Counter();
              c.test();
          }

      }

      class Counter {
          int count = 0;

          synchronized void increment() {
              count = count + 1;
          }

          public void test() {
              int numProcessors = Runtime.getRuntime().availableProcessors();
              ExecutorService executor = Executors.newFixedThreadPool(numProcessors);
              IntStream.range(0, 10000)
                  .forEach(i -> executor.submit(this::increment));

              executor.shutdown();
              System.out.println(count);
          }
      }
    #+end_src

    #+RESULTS:
    : 10000

    There are more uses to the keyword synchronized, but we do not discuss them
    in this tutorial.


